#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Accadius/kubernetes-ops-staging-10-vpc/runs/run-h18MwwBcBfaaDYJs

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                 = "staging-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all             = {
          + "Name"                 = "staging-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc                  = true
    }

  # module.vpc.module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                 = "staging-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all             = {
          + "Name"                 = "staging-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc                  = true
    }

  # module.vpc.module.vpc.aws_eip.nat[2] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                 = "staging-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all             = {
          + "Name"                 = "staging-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc                  = true
    }

  # module.vpc.module.vpc.aws_elasticache_subnet_group.elasticache[0] will be created
  + resource "aws_elasticache_subnet_group" "elasticache" {
      + arn         = (known after apply)
      + description = "ElastiCache subnet group for staging"
      + id          = (known after apply)
      + name        = "staging"
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all    = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
    }

  # module.vpc.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"                 = "staging-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all             = {
          + "Name"                 = "staging-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"                 = "staging-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all             = {
          + "Name"                 = "staging-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"                 = "staging-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all             = {
          + "Name"                 = "staging-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "staging-private-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all         = {
          + "Name"                 = "staging-private-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "staging-private-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all         = {
          + "Name"                 = "staging-private-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "staging-private-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all         = {
          + "Name"                 = "staging-private-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "staging-public"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all         = {
          + "Name"                 = "staging-public"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[0] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[1] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[2] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[0] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "100.64.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-elasticache-us-east-1a"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-elasticache-us-east-1a"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[1] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "100.64.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-elasticache-us-east-1c"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-elasticache-us-east-1c"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[2] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "100.64.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-elasticache-us-east-1d"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-elasticache-us-east-1d"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-private-us-east-1a"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-private-us-east-1a"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-private-us-east-1c"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-private-us-east-1c"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-private-us-east-1d"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-private-us-east-1d"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                          = "staging-public-us-east-1a"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                          = "staging-public-us-east-1a"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                          = "staging-public-us-east-1c"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                          = "staging-public-us-east-1c"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                          = "staging-public-us-east-1d"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                          = "staging-public-us-east-1d"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                             = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
    }

  # module.vpc.module.vpc.aws_vpc_ipv4_cidr_block_association.this[0] will be created
  + resource "aws_vpc_ipv4_cidr_block_association" "this" {
      + cidr_block = "100.64.0.0/16"
      + id         = (known after apply)
      + vpc_id     = (known after apply)
    }

  # module.vpc.module.vpc.aws_vpn_gateway.this[0] will be created
  + resource "aws_vpn_gateway" "this" {
      + amazon_side_asn = "64512"
      + arn             = (known after apply)
      + id              = (known after apply)
      + tags            = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all        = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id          = (known after apply)
    }

Plan: 37 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + k8s_subnets     = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id          = (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 7 estimated
           $0.0/mo +$0.0

```


</details>

*Pusher: @yaccad, Action: `pull_request`*